Revit.Elements.CeilingType
A Revit CeilingType

Revit.Elements.CeilingType.InternalCeilingType
An internal reference to the CeilingType

Revit.Elements.CeilingType.#ctor(Autodesk.Revit.DB.CeilingType)
Construct from an existing Revit Element
type:

Revit.Elements.CeilingType.Name
The name of the CeilingType

Revit.Elements.CeilingType.ByName(System.String)
Select a CeilingType from the document given
name:
Returns:

Revit.Elements.CeilingType.FromExisting(Autodesk.Revit.DB.CeilingType,System.Boolean)
Create a CeilingType from a user selected Element.
ceilingType:
isRevitOwned:
Returns:

Revit.Elements.CeilingType.GetThermalProperties
The calculated and settable thermal properties of the CeilingType
Value of absorptance.
The heat transfer coefficient value (U-Value).
Value of roughness.
The calculated thermal mass value.
The calculated thermal resistance value (R-Value).